export interface AboutShop {
  id: number;
  title: string;
  description: string;
}

export const aboutShop: AboutShop[] = [
  {
    id: 1,
    title: 'Корисна інформація',
    description: 'Статті про ментальне здоров’я та поради як його покращити.',
  },
  {
    id: 2,
    title: 'Тестування',
    description:
      'Інструменти для оцінки вашого психічного стану, схвалені МОЗ України та ВООЗ.',
  },
  {
    id: 3,
    title: 'Магазин MH',
    description:
      'Препарати та ліки, що допомагають полегшити симптоми ментальних розладів.',
  },
  {
    id: 4,
    title: 'Щоденник MH',
    description:
      'Інструмент для кращого розуміння вашого стану, а також формування корисних звичок.',
  },
  {
    id: 5,
    title: 'Психологічна допомога',
    description: 'Контакти анонімної безоплатної допомоги від спеціалістів.',
  },
];
