import { TestOptions } from '../shared/models/test-options.model';
import { TestsResult } from '../shared/models/testsResult.model';

export const testOptions: TestOptions[] = [
  { label: 'Не турбували взагалі', value: 0 },
  { label: 'Протягом декількох днів', value: 1 },
  { label: 'Більше половини часу', value: 2 },
  { label: 'Майже кожного дня', value: 3 },
];

export const testsResult: TestsResult[] = [
  {
    testId: 10,
    explanation: [
      {
        range: { min: 0, max: 4 },
        results: '0-4 бали - Депресія відсутня.',
        text: 'Вітаємо, ваше ментальне здоров’я в нормі. Важливо і надалі про нього піклуватись. Для цього потрібно: Підтримувати належну якість сну, спати не менше 7-8 годин на добу; Намагатися уникати стресових ситуацій та навчитись спокійно на них реагувати; Правильно харчуватись; Бути фізично активною/активним. Періодично проходьте це тестування з метою своєчасного виявлення депресії та її усунення.',
      },
      {
        range: { min: 5, max: 9 },
        results: '5-9 балів - Легка («субклінічна») депресія.',

        text: 'Результат відповідей дає підстави припустити, що у вас депресія легкого ступеня. Рекомендовано звернути увагу на ваш спосіб життя: Збалансовано харчуватись; Покращити якість сну, спати не менше 7-8 годин на добу; Гуляти на свіжому повітрі; Зменшити час використання гаджетів. Для зниження симптомів депресії легкого ступеня рекомендовано прийняти курс рослинно-вітамінних комплексів та засобів для покращення сну. Через 4 тижні пройдіть це тестування повторно з метою своєчасного виявлення депресії та її усунення.',
      },
      {
        range: { min: 10, max: 14 },
        results: '10-14 балів - Помірної тяжкості депресія.',
        text: 'Результат відповідей дає підстави припустити, що у вас депресія помірного ступеня, яка негативно впливає на самопочуття, знижує вашу працездатність, та може бути причиною фізичних симптомів. Такий стан потребує медичної корекції. Вам рекомендовано звернутися по професійну допомогу до сімейного лікаря або психотерапевта, який призначить необхідне лікування.',
      },
      {
        range: { min: 15, max: 27 },
        results: '15-27 балів - Середньої тяжкості депресія.',
        text: 'Результат відповідей дає підстави припустити, що у вас депресія середнього ступеня, яка негативно впливає на самопочуття, знижує вашу працездатність, та може бути причиною фізичних симптомів. Такий стан потребує медичної корекції. Вам рекомендовано звернутися по професійну допомогу до сімейного лікаря або психотерапевта, який призначить необхідне лікування, щоб запобігти виникненню можливих ускладнень фізичних захворювань.',
      },
    ],
  },
  {
    testId: 210,
    explanation: [
      {
        range: { min: 0, max: 4 },
        results: 'Ваші результати низькі. ',
        text: 'Ймовірно, у вас немає тривожного стану.',
      },
      {
        range: { min: 5, max: 9 },
        results: 'Ви відчуваєте деякий рівень тривоги.',
        text: 'Рекомендується звернутися до спеціаліста для консультації.',
      },
      {
        range: { min: 10, max: 14 },
        results: 'Ваші результати показують помірний рівень тривоги.',
        text: 'Рекомендується розглянути можливість консультації з фахівцем.',
      },
      {
        range: { min: 15, max: 21 },
        results: 'Ви показали високий рівень тривоги.',
        text: 'Рекомендується звернутися до спеціаліста для отримання кваліфікованої допомоги.',
      },
    ],
  },
];
