import { Test } from '../shared/models/online-test.model';

export const testsList: Test[] = [
  {
    id: 10,
    title: 'Тест PHQ-9',
    img: 'https://mhealthzdravo-website-app.s3.eu-central-1.amazonaws.com/tests/1704890116.2965.jpg',
    problemName: 'Тест на депресивний розлад',
    subtitle:
      'Пройдіть тест, якщо відчуваєте смуток та апатію протягом 2х тижнів.',
    describe:
      'Цей тест допоможе вам оцінити рівень депресивного розладу. Відповідайте чесно на питання про ваш настрій, емоції та фізичне самопочуття. Він призначений для всіх, хто відчуває симптоми депресії та хоче отримати корисні рекомендації.',
    longDescription:
      'Цей тест допоможе вам краще зрозуміти рівень вашого депресивного стану, відповідаючи на серію запитань. Ви дізнаєтесь більше про свій настрій та емоційний стан, а також отримаєте рекомендації щодо подальших дій.',
    instructions:
      'Відповідайте на всі запитання чесно і ретельно, щоб отримати найточніші результати. Тест займає приблизно 5 хвилин.',
    targetAudience:
      'Цей тест підходить для всіх, хто відчуває симптоми депресії та хоче оцінити свій емоційний стан.',
    questions: [
      'Дуже низький інтерес або задоволення від звичайних справ.',
      'Поганий настрій, пригніченість або відчуття безнадійності.',
      'Труднощі з засипанням, переривчастий або надто тривалий сон.',
      'Відчуття втоми або виснаження (втомленість).',
      'Поганий апетит або, навпаки, переїдання.',
      'Негативні думки про себе, відчуття, що ви невдаха, розчаровані в собі або вважаєте, що не виправдали очікувань своєї родини.',
      'Труднощі концентрації уваги (наприклад, сконцентруватися на читанні газети або перегляді телепередач).',
      'Ваші рухи або мова були настільки повільними, що оточуючі могли це помітити. Або, навпаки, ви були настільки суєтливі або збуджені, що рухались більше, ніж зазвичай.',
      'Думки про те, що вам було б краще померти, або думки про те, що нанести собі шкоду яким-небудь способом.',
    ],
  },
  {
    id: 210,
    title: 'Тест GAD-7',
    img: 'https://mhealthzdravo-website-app.s3.eu-central-1.amazonaws.com/tests/1705319661.8401.jpg',
    problemName: 'Тест на тривожний стан',
    subtitle:
      'Пройдіть тест, якщо нервуєте та тривожитесь кожен день понад два тижні.',
    describe:
      "Цей тест допоможе вам оцінити рівень вашої тривожності та дізнатися, чи варто звертатися до спеціаліста. Відповідайте чесно на питання, щоб отримати корисні рекомендації. Тест призначений для студентів, випускників та всіх, хто шукає нові кар'єрні можливості або планує змінити професію.",
    longDescription:
      'Цей тест допоможе вам зрозуміти рівень вашої тривожності та визначити, чи варто звертатися до фахівця. Відповідаючи на запитання, ви зможете оцінити свій стан та отримати корисні рекомендації.',
    instructions:
      'Відповідайте на всі запитання чесно і ретельно, щоб отримати найточніші результати. Тест займає приблизно 5 хвилин.',
    targetAudience:
      "Цей тест призначений для студентів, випускників та всіх, хто шукає новий кар'єрний шлях або хоче змінити свою професію.",
    questions: [
      'Ви нервували, відчували тривогу або були дуже напружені.',
      'Ви не могли зупинити або контролювати своє хвилювання.',
      'Ви занадто хвилювались через різні речі.',
      'Вам було важко розслабитися.',
      'Ви були настільки неспокійні, що вам було важко сидіти на одному місці.',
      'Вас легко роздратовували або зліли.',
      'Ви відчували страх, наче може статися щось жахливе.',
    ],
  },
];
