import { TestOptions } from '../shared/models/test-options.model';
import { TestsResult } from '../shared/models/testsResult.model';

export const testOptions: TestOptions[] = [
  { label: 'Не турбували взагалі', value: 0 },
  { label: 'Протягом декількох днів', value: 1 },
  { label: 'Більше половини часу', value: 2 },
  { label: 'Майже кожного дня', value: 3 },
];

export const testsResult: TestsResult[] = [
  {
    testId: 10,
    explanation: [
      {
        range: { min: 0, max: 4 },
        results: '0-4 бали - Депресія відсутня.',
        text: 'Наші рекомендації: Вітаємо, ваше ментальне здоров’я в нормі. Важливо і надалі про нього піклуватись.\nДля цього потрібно:\nПідтримувати належну якість сну, спати не менше 7-8 годин на добу;\nНамагатися уникати стресових ситуацій та навчитись спокійно на них реагувати;\nПравильно харчуватись;\nБути фізично активною/активним.\nПеріодично проходьте це тестування з метою своєчасного виявлення депресії та її усунення.',
      },
      {
        range: { min: 5, max: 9 },
        results: '5-9 балів - Легка («субклінічна») депресія.',
        text: '\nНаші рекомендації:\nРезультат відповідей дає підстави припустити, що у вас депресія легкого ступеня.\nРекомендовано звернути увагу на ваш спосіб життя:\nЗбалансовано харчуватись;\nПокращити якість сну, спати не менше 7-8 годин на добу;\nГуляти на свіжому повітрі;\nЗменшити час використання гаджетів.\nДля зниження симптомів депресії легкого ступеня рекомендовано прийняти курс рослинно-вітамінних комплексів та засобів для покращення сну.\nЧерез 4 тижні пройдіть це тестування повторно з метою своєчасного виявлення депресії та її усунення.',
      },
      {
        range: { min: 10, max: 14 },
        results: '10-14 балів - Помірної тяжкості депресія.',
        text: '\nНаші рекомендації:\nРезультат відповідей дає підстави припустити, що у вас депресія помірного ступеня, яка негативно впливає на самопочуття, знижує вашу працездатність, та може бути причиною фізичних симптомів.\nТакий стан потребує медичної корекції.\nВам рекомендовано звернутися по професійну допомогу до сімейного лікаря або психотерапевта, який призначить необхідне лікування.',
      },
      {
        range: { min: 15, max: 27 },
        results: '15-27 балів - Середньої тяжкості депресія.',
        text: '\nНаші рекомендації:\nРезультат відповідей дає підстави припустити, що у вас депресія середнього ступеня, яка негативно впливає на самопочуття, знижує вашу працездатність, та може бути причиною фізичних симптомів.\nТакий стан потребує медичної корекції.\nВам рекомендовано звернутися по професійну допомогу до сімейного лікаря або психотерапевта, який призначить необхідне лікування, щоб запобігти виникненню можливих ускладнень фізичних захворювань.',
      },
    ],
  },
  {
    testId: 210,
    explanation: [
      {
        range: { min: 0, max: 4 },
        results: 'Ваші результати низькі. ',
        text: 'Ймовірно, у вас немає тривожного стану.',
      },
      {
        range: { min: 5, max: 9 },
        results: 'Ви відчуваєте деякий рівень тривоги.',
        text: 'Рекомендується звернутися до спеціаліста для консультації.',
      },
      {
        range: { min: 10, max: 14 },
        results: 'Ваші результати показують помірний рівень тривоги.',
        text: 'Рекомендується розглянути можливість консультації з фахівцем.',
      },
      {
        range: { min: 15, max: 21 },
        results: 'Ви показали високий рівень тривоги.',
        text: 'Рекомендується звернутися до спеціаліста для отримання кваліфікованої допомоги.',
      },
    ],
  },
];
