import { TestOptions } from '../shared/models/test-options.model';
import { TestsResult } from '../shared/models/testsResult.model';

export const testOptions: TestOptions[] = [
  { label: 'Не турбували взагалі', value: 0 },
  { label: 'Протягом декількох днів', value: 1 },
  { label: 'Більше половини часу', value: 2 },
  { label: 'Майже кожного дня', value: 3 },
];

export const testsResult: TestsResult[] = [
  {
    testId: 10,
    explanation: [
      {
        range: { min: 0, max: 4 },
        results: '0-4 бали - Депресія відсутня.',
        text: 'Вітаємо, ваше ментальне здоров’я в нормі. Важливо і надалі про нього піклуватись. Для цього потрібно: Підтримувати належну якість сну, спати не менше 7-8 годин на добу; Намагатися уникати стресових ситуацій та навчитись спокійно на них реагувати; Правильно харчуватись; Бути фізично активною/активним. Періодично проходьте це тестування з метою своєчасного виявлення депресії та її усунення.',
      },
      {
        range: { min: 5, max: 9 },
        results: '5-9 балів - Легка («субклінічна») депресія.',
        text: 'Результати свідчать про наявність у вас депресії легкого ступеня. Депресія має негативний вплив на якість життя та здоров’я.Така депресія може призводити мотивації, зниження енергії та працездатності. Також вона впливає на фізичне здоров’я: головний біль, шлунково-кишкові розлади, загострення серцево-судинних захворювань, висипання на шкірі, зміни апетиту та лібідо - часті прояви депресії. Люди з депресією легкого ступеня можуть недооцінювати серйозність свого стану, хоча він впливає не тільки на здоров’я людини, а й на стосунки з близькими, успіхи в роботі та соціальне життя. Ви молодець, що звернули увагу на свій стан. Гарна новина в тому, що раннє втручання потребує менше зусиль та ресурсів і допомагає швидше повернутись до нормального життя.Почніть з простих кроків: ведення щоденника, налагодження режиму сну, збільшення фізичної активності, збалансоване харчування, спілкування з друзями, прийом рослинно-вітамінних комплексів.Перегляньте підбірку простих засобів, що можуть вам допомогти. Через 4 тижні варто ще раз пройти це тестування аби визначити, чи змінився ваш психічний стан. Якщо ваш стан не покращиться за цей чам, рекомендовано звернутись до сімейного лікаря або спеціаліста (психотерапевта чи психіатра).',
        recomendIdList: [45, 31, 68],
      },
      {
        range: { min: 10, max: 14 },
        results: '10-14 балів - Помірної тяжкості депресія.',
        text: 'Результат відповідей дає підстави припустити, що у вас депресія помірного ступеня, яка негативно впливає на самопочуття, знижує вашу працездатність, та може бути причиною фізичних симптомів. Такий стан потребує медичної корекції. Вам рекомендовано звернутися по професійну допомогу до сімейного лікаря або психотерапевта, який призначить необхідне лікування.',
      },
      {
        range: { min: 15, max: 27 },
        results: '15-27 балів - Середньої тяжкості депресія.',
        text: 'Результат відповідей дає підстави припустити, що у вас депресія середнього ступеня, яка негативно впливає на самопочуття, знижує вашу працездатність, та може бути причиною фізичних симптомів. Такий стан потребує медичної корекції. Вам рекомендовано звернутися по професійну допомогу до сімейного лікаря або психотерапевта, який призначить необхідне лікування, щоб запобігти виникненню можливих ускладнень фізичних захворювань.',
      },
    ],
  },
  {
    testId: 210,
    explanation: [
      {
        range: { min: 0, max: 5 },
        results: 'Відсутність тривоги.',
        text: "Ви проявляєте лише мінімальну тривогу або не виявляєте її взагалі: вітаємо Вас! Вам рекомендовано і надалі підтримувати ваше ментальне здоров'я. Для цього ви самостійно можете: подбати про гігієну сну; намагатися уникати стресових ситуацій та навчитись адекватно на них реагувати; збалансувати харчування і додати фізичної активності. Обов'язково раз на 4 тижні проходити повторне тестування з метою своєчасного виявлення депресії та її усунення.",
      },
      {
        range: { min: 6, max: 10 },
        results: 'Легка тривога.',
        text: "Ви проявляєте легку тривогу. Вам рекомендовано і надалі стежити за своїм ментальним здоров'ям. При такому стані рекомендовано звернути увагу на ваш спосіб життя: перейти на здорове збалансоване харчування, дотримуватися психологічної гігієни сну, організувати прогулянки на свіжому повітрі, зменшити час використання мобільного телефону. Для зниження симптомів легкої тривоги рекомендовано приймати курс рослинно-вітамінних комплексів та засобів для покращення сну. Обов'язково раз на 4 тижні проходити повторне тестування з метою своєчасного виявлення депресії та її усунення.",
      },
      {
        range: { min: 11, max: 15 },
        results: 'Помірна тривога.',
        text: 'Ви проявляєте помірну тривогу. Такий стан негативно впливає на ваше самопочуття, знижує працездатність та може бути причиною виникнення негативних фізичних симптомів. Вам рекомендовано звернутися по професійну допомогу до сімейного лікаря або психотерапевта, який призначить необхідне лікування.',
      },
      {
        range: { min: 15, max: 27 },
        results: 'Сильна тривога.',
        text: "Ви проявляєте сильну тривогу, яка негативно впливає на всі сфери вашого життя та підвищує ризик розвитку різних хронічних захворювань. Такий стан потребує обов'язкової медичної корекції. Вам рекомендовано без зволікань звернутися до психолога, лікаря-психотерапевта або психіатра для детальної консультації та призначення лікування та попередити можливі ускладнення соматичних захворювань. Також, ви можете звернутися за консультацією до психотерапевта.",
      },
    ],
  },
];
