export const croxenInfo = {
  name: 'Кроксен',
  description:
    'Кроксен - рослинний антидепресант, на основі екстракту шафрану, магнію та вітамінів групи В, який сприяє зниженню симптомів депресії, заспокоєнню та покращенню сну.',
  composition: {
    extract: 'Экстракт шафрану (Crocus L sativus) 30 мг',
    folicAcid: 'Фолієва кислота 500 мкг',
    vitaminB6: 'Вітамін B6 1,4 мг',
    vitaminB1: 'Вітамін B1 1,1 мг',
    vitaminB12: 'Вітамін B12 250 мкг',
    magnesium: 'Магній 320 мг',
  },
  recommendations:
    'Людям з депресією легкого ступеню важкості*, які скаржаться на пригнічений настрій, відчуття постійної втоми, відсутність енергії та мотивації та ін.',
  symptoms:
    'Симптоми депресивного розладу: пригнічення, втрата інтересу, неспокій, неможливість відчувати радість, апатія, зменшення життєвої енергії, пасивність, тривога, сонливість або безсоння, низька концентрація, втрата апетиту, низька самооцінка, відчуття провини чи відчаю',
  advantages: [
    'Не потрібно рецепт лікаря',
    'Прийом 1 раз на добу',
    'Безпечний (не викликає звикання навіть при тривалому прийомі)',
    'Комплексна дія Кроксену : антидепресантна, протитривожна та загальнозміцнююча (екстракт шафрану (Кроцин, Кроцетин, Сафранал), Магній+В6, вітаміни).',
  ],
  clinicalExperience:
    'Прийом екстракту шафрану в дозі 30 мг 1 раз на добу у пацієнтів з легкою або помірною депресією показав ефективність в зменшенні симптомів за шкалою Гамільтона , що були схожими з результатами прийому флуоксетину в дозі 40 мг 1 раз на добу.',
  usageInstructions:
    'Дітям віком старше 12 років по 1 капсулі та дорослим по 1-2 капсули 1 раз на добу, у другій половині дня або перед сном запиваючи водою. Курс прийому: мінімально 1 місяць або відповідно до рекомендації лікаря, рекомендований курс прийому 3 місяці.',
  warnings:
    'Індивідуальна непереносимість компонентів. З обережністю приймати людям з пониженим артеріальним тиском. Підвищена чутливість до будь-якого компоненту Кроксену. Шафран являється сильнодіючим біологічно активним продуктом, приймати його слід з обережністю. Не перевищувати рекомендовану дозу. При передозуванні можлива нудота, блювання, висипання на шкірі, сплутаність свідомості. Дієтичну добавку не слід використовувати як заміну повноцінного раціону харчування. Не є лікарським засобом.',
  ageRestrictions: 'дозволений з 12 років.',
  packagingAndStorage:
    '30 желатинових капсул у блістерах, у картонній коробці. Зберігати в оригінальній упаковці при температурі не вище 25 ºС у сухому, захищеному від світла та недоступному для дітей місці. Дієтичну добавку не слід використовувати після закінчення строку придатності. Перед використанням обов’язково проконсультуйтесь з лікарем.',
  manufacturer:
    'ЗАО «Aconitum», вул. Іновації 4, с. Бірулішкес, Каунаський район, LT-54469, Литва.',
  importer:
    'ТОВ «Здраво». Україна, 04414, м.Київ, вул.Автозаводська, 54/19 літ.А, офіс.',
};

export const productsOriginal = [
  {
    id: 21,
    name: 'Кроксен',
    description:
      'Кроксен - рослинний антидепресант, на основі екстракту шафрану, магнію та вітамінів групи В, який сприяє зниженню симптомів депресії, заспокоєнню та покращенню сну.',
    shortDescription: 'рослинний антидепресант',
    inStock: false,
    price: 660,
    priceDiscounted: 0,
    photo:
      'https://mhealthzdravo-website-app.s3.eu-central-1.amazonaws.com/images/products/1703619921.8543.jpg',
  },
  {
    id: 31,
    name: "Щоденник ментального здоров'я",
    description:
      'Щоденник МН це ефективний інструмент для самодопомоги, що зорієнтує у власних емоціях та думках і покращить самопочуття. Базується на принципах одного з провідних і науково обґрунтованих методів - когнітивно-поведінкової терапії (CBT). Це доступний продукт у випадках, якщо через психологічні бар’єри, фінансову складову або обмежений час виникають складнощі відвідувати психотерапевта, а також може слугувати як корисний інструмент до основної терапії. Увага! Вигідна пропозиція! При купівлі разом з препаратами ви можете отримати Щоденник МН за акційною ціною - 220 грн (33,34% вигоди). Акція діє з 1 червня 2024 року до 30 серпня 2024 року. Детальну інформацію можна отримати у оператора за номером: 0800-337-025',
    shortDescription: 'Для поліпшення настрою, подолання тривоги та стресу',
    inStock: true,
    price: 330,
    priceDiscounted: 220,
    photo:
      'https://mhealthzdravo-website-app.s3.eu-central-1.amazonaws.com/images/products/1716977020.1517.jpg',
  },
  {
    id: 45,
    name: 'Дзенекс',
    description:
      'Дзенекс - комбінований антистресовий засіб для підтримки стресостійкості та покращення когнітивних функцій.',
    shortDescription: 'комплекс від стресу',
    inStock: true,
    price: 260,
    priceDiscounted: 0,
    photo:
      'https://mhealthzdravo-website-app.s3.eu-central-1.amazonaws.com/images/products/1703709322.3119.jpg',
  },
  {
    id: 58,
    name: 'Нордіксин',
    description: 'Нордіксин - протитривожний лікарський засіб.',
    shortDescription: 'протитривожний лікарський засіб',
    inStock: true,
    price: 450,
    priceDiscounted: 0,
    photo:
      'https://mhealthzdravo-website-app.s3.eu-central-1.amazonaws.com/images/products/1715087022.5242.jpg',
  },
  {
    id: 68,
    name: 'Мелоксонін спрей',
    description:
      'Мелоксонін спрей - безпечний снодійний засіб для поліпшення засинання: - Пришвидшує засинання, подовжує та поглиблює сон; - Підтримує безперервний сон вночі та покращує настрій, підвищує; працездатність, знижує втомлюваність вдень; - Сприяє спокійному засинанню та повноцінному відновлюючому сну завдяки міорелаксуючій та протитривожній дії.',
    shortDescription: 'засіб для поліпшення засинання',
    inStock: true,
    price: 290,
    priceDiscounted: 0,
    photo:
      'https://mhealthzdravo-website-app.s3.eu-central-1.amazonaws.com/images/products/1704891879.0558.jpg',
  },
  {
    id: 90,
    name: 'Мелоксонін лонг найт таблетки',
    description:
      'Мелоксонін лонг найт таблетки - безпечний снодійний засіб для поліпшення тривалості та глибини сну. - Підвищує тривалість та якість сну, попереджує раптові пробудження; - Підтримує безперервний сон вночі; - Покращує настрій вдень за рахунок вмісту L-триптофану.',
    shortDescription: 'безпечний снодійний засіб',
    inStock: true,
    price: 300,
    priceDiscounted: 0,
    photo:
      'https://mhealthzdravo-website-app.s3.eu-central-1.amazonaws.com/images/products/1703619984.03.jpg',
  },
  {
    id: 103,
    name: 'Калмавіс',
    description:
      'Калмавіс - комбінація рослинних компонентів, що сприяє заспокоєнню, зниженню тривоги, дратівливості, неспокою. Заспокійливий засіб: - при інтенсивних розумових та фізичних навантаженнях, пов’язаних з нервовою напругою; - при підвищеній нервовій збудливості, дратівливості, неврівноваженості, лабільності настрою, при порушеннях сну; - в періоди, коли тривога та постійне хвилювання перешкоджають зосередженості та спокою.',
    shortDescription: 'комплекс для заспокоєння',
    inStock: true,
    price: 275,
    priceDiscounted: 0,
    photo:
      'https://mhealthzdravo-website-app.s3.eu-central-1.amazonaws.com/images/products/1703619984.03.jpg',
  },
];
